# IsPressureDropServerMissing Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PipingSystem..::..IsPressureDropServerMissing Method
PipingSystem Class See Also
---
Indicates if any pressure drop server which was used in the piping system is not available.
**Namespace:** Autodesk.Revit.DB.Plumbing**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool IsPressureDropServerMissing()
```

Visual Basic
---
```text
Public Function IsPressureDropServerMissing As Boolean
```

Visual C++
---
```text
public:
bool IsPressureDropServerMissing()
```

# ### Return Value
True if there is any pressure drop server not available, false otherwise.
# See Also
PipingSystem Class
Autodesk.Revit.DB.Plumbing Namespace